## Titanic : Machine Learning from Disaster

`test.csv` 파일을 읽어 데이터프레임 객체로 변환한 후 아래 문제들을 해결해보시오.

---

### Ref.
https://www.kaggle.com/datasets/shuofxz/titanic-machine-learning-from-disaster

### Level.1
---

1. `pandas`를 사용하여 `train.csv` 파일 데이터를 불러와 **DataFrame**으로 저장하시오.

In [1]:
import pandas as pd

df = pd.read_csv('train.csv')
df = pd.DataFrame(df)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

2. 저장된 데이터에서 상위 5개 행을 출력하시오.

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

3. 각 열의 이름, 결측치 여부, 데이터 타입(`dtype`)을 한 번에 확인하시오.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

4. `Age`(나이), `Fare`(요금) 열의 평균값, 최솟값, 최댓값을 구하시오.

In [4]:
Age = df['Age'].agg(['mean', 'min', 'max'])
Fare = df['Fare'].agg(['mean', 'min', 'max'])
Age
Fare
print(f'나이 :\n{Age}\n 요금 :\n{Fare}')

나이 :
mean    29.699118
min      0.420000
max     80.000000
Name: Age, dtype: float64
 요금 :
mean     32.204208
min       0.000000
max     512.329200
Name: Fare, dtype: float64

5. 탑승객 중 생존자와 사망자가 각각 몇 명인지 계산하시오.
- 생존자 : `Survived`=1 / 사망자 : `Survived`=0

In [5]:
alive = df[df['Survived'] == 1]
print(f"생존자 {alive['Survived'].size} 명")

dead = df[df['Survived'] == 0]
print(f"사망자 {dead['Survived'].size} 명")

생존자 342 명
사망자 549 명

6. 객실 등급(`Pclass`)별로 탑승객이 몇 명인지 계산하시오.

In [6]:
df.groupby('Pclass').size()

Pclass
1    216
2    184
3    491
dtype: int64

7. 나이가 50세 이상인 탑승객만 추출하여 새로운 데이터프레임을 만드시오.

In [7]:
df_50_Age = df[df['Age'] >= 50]
df_50_Age

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...,...,...,...
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

8. 탑승객을 나이대 기준으로 그룹화하여 새로운 열 `AgeGroup`을 추가한 후, 상위 5개 행을 확인하시오.
    - 13세 -> 10대 그룹에 속함. 28세 -> 20대 그룹에 속함

In [ ]:
# df['AgeGroup'] = df.groupby('Age')
'''
if 10 <= df['Age'] > 20 :
  df['10대 그룹']
elif 20 <= df['Age'] > 30:
  df['20대 그룹']
elif 30 <= df['Age'] > 40:
  df['30대 그룹']
elif 40 <= df['Age'] > 50:
  df['40대 그룹']
elif 50 <= df['Age']:
  df['50대 이상 그룹']
'''
df.groupby('Age').size()

Age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Length: 88, dtype: int64

### Level.2
---

9. 성별(`Sex`)과 객실 등급(`Pclass`)을 기준으로 그룹화하여 각각의 평균 생존율을 계산하시오.

In [ ]:
# df.groupby(['Sex'], ['Pcalss'])['']

     PassengerId  Survived  Pclass Name  Sex  Age  SibSp  Parch Ticket  Fare  \
0            NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
1            NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
2            NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
3            NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
4            NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
..           ...       ...     ...  ...  ...  ...    ...    ...    ...   ...
886          NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
887          NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
888          NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
889          NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN
890          NaN       NaN     NaN  NaN  NaN  NaN    NaN    NaN    NaN   NaN

    Cabin Embarked
0     NaN      NaN
1     NaN      NaN
2     NaN      NaN
3     NaN      NaN
4     NaN      NaN
..    ...      ...
886   NaN      NaN
887   NaN      NaN
888   NaN      NaN
889   NaN      NaN
890   NaN      NaN

[891 rows x 12 columns]

10. 나이대별 평균 생존율을 계산하시오.

11. 각 열에 존재하는 결측치(`NaN`)의 총 개수와 전체 데이터 대비 비율을 계산하여 내림차순으로 출력하시오.

12. `Age` 열의 결측치를 승객들의 나이 중앙 값으로 채우세요. (원본 프레임에 적용)

In [38]:
# df[df['Age'].isna()]

13. `Sex`열의 **'male'**은 0으로, **'female'**은 1로 변경하여 **Gender_Encoded**라는 새로운 열을 추가하시오.

14. 탑승지(`Embarked`)별로 승객이 지불한 요금(`Fare`)의 평균을 계산하시오.

15. `Pclass`를 인덱스로, `Sex`를 컬럼으로, 값으로 `Fare`의 평균을 사용하여 **피벗 테이블**을 생성하시오.

16. `SibSp` (형제/배우자 수)와 `Parch` (부모/자녀 수)를 합산하여 `FamilySize` 열을 추가하고, 이 열의 요약 통계를 확인하세요.

17. `Name` 열에서 호칭(Mr., Miss, Mster.)을 정규 표현식 또는 문자열 함수를 사용하여 추출하고 `Title`이라는 새로운 열을 생성한 뒤, 가장 흔한 5개의 호칭을 출력하시오.

18. 생존한 사람과 사망한 사람의 나이(`Age`) 분포를 비교할 수 있도록 시각화하시오.

### Level. 3
---

19. `Age` 열의 결측치를 단순히 전체 평균/중앙값으로 채우지 않고, 추출한 `Title`과 `Pclass`를 동시에 고려하여 해당 그룹의 나이 중앙값으로 대치하시오.
    - ex. 'Master' 타이틀을 가진 1등급 승객 그룹의 나이 중앙값으로 해당 그룹의 결측치를 채움

20. `Survived`, `Pclass`, `Age`, `SibSp`, `Parch`, `Fare` 등의 수치형 변수들 간의 상관관계 행렬을 계산하고, 그 결과를 **히트맵(Heatmap)** 으로 시각화하시오.
    - hint. corr() : 상관관계 행렬 계산 함수